Tekla.Structures.DrawingInternal.TSDrawingColorHandler
C# side manager class to access OpenAPI functions on C++ side. These functions handle
all TS color interaction that has to do with reading/writing to/from a saved format,
and converting color index values to and from other "standard" representations.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.NumberOfStandardColors
The number of standard colors.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.StandardColorInfo
Gets a list of standard indexes, colors and names that are able to be assigned to drawing objects.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.StandardColors
Gets a list of standard colors that are able to be assigned to drawing objects.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.StandardColorNames
Gets a list of tuples containing standard color name albl-tags and possible postfixes.
The albl-tags are meant to be used for obtaining the correct translated string, the postfixes
can be used for providing not-to-be-translated data, like " 90%".

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetColorIndexFromRGB(System.Byte,System.Byte,System.Byte)
Gets the colorIndex corresponding to the RGB input values.
The following example shows how to call the function GetColorIndexFromRGB.
using Tekla.Structures.DrawingInternal;
int encodedColorIndex = TSDrawingColorHandler.GetColorIndexFromRGB(255, 0, 0); // red color
red: The red component of the color, in the range 0-255.
green: The green component of the color, in the range 0-255.
blue: The blue component of the color, in the range 0-255.
Returns: The TS globally unique color index

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.TryGetRGBFromColorIndex(System.Int32,System.Byte@,System.Byte@,System.Byte@)
Gets the RGB values corresponding to the . If the passed in
is a standard TS color, but is not one allowed to be assigned
to objects, the function will return false, and the color black will be returned.
The following example shows how to call the function TryGetRGBFromColorIndex.
using Tekla.Structures.DrawingInternal;
if(TSDrawingColorHandler.TryGetRGBFromColorIndex(-1, out var red, out var green, out var blue))
{
// if red, green, blue are populated correctly, TryGetRGBFromColorIndex will return true,
// and we will land inside this if statement.
}
colorIndex: TS globally unique color index.
red: The resulting value of the red color component, in the range 0-255.
green: The resulting value of the green color component, in the range 0-255.
blue: The resulting value of the blue color component, in the range 0-255.
Returns:
True if  is a user defined color, or if it is a TS standard color
intended for use on TS objects in drawings (beams, etc)./>

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.IsStandardColor(System.Int32)
Returns true if  is a standard color. False if it is a user defined color.
The following example shows how to call the function IsStandardColor.
using Tekla.Structures.DrawingInternal;
bool test = TSDrawingColorHandler.IsStandardColor(153); // should return true
colorIndex: TS globally unique colorIndex.
Returns: true if  is a standard color. False if it is a user defined color.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetAsTrueColor(Tekla.Structures.Drawing.DrawingColors)
Get an RGB color for the inputColor that is a DrawingColors enum value
inputColor: The input color as an enum
Throws System.ArgumentOutOfRangeException: Will throw if the inputColor is not supported.
You should use this function in a try-catch statement, since non-supported colors are used
in TeklaStructures. Define your own catch logic (default color, error message, etc) based
on your use case
Returns: A TeklaDrawingColor RGB color corresponding to the the inputColor

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetColorIndexFromSaveFormat(System.String)
Returns TS globally unique colorIndex for the input  string.
The following example shows how to call the function GetColorIndexFromSaveFormat.
using Tekla.Structures.DrawingInternal;
int Color = TSDrawingColorHandler.GetColorIndexFromSaveFormat("0xFFFFFFFF"); // should return -1
saveFormat: Color saveFormat: hex "0xFF140413" or TS standard colorIndex "153".
This is the preferred format when saving to external files.
Returns: TS globally unique colorIndex.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetSaveFormatFromColorIndex(System.Int32)
Returns saveFormat from the TS globally unique .
The following example shows how to call the function GetSaveFormatFromColorIndex.
using Tekla.Structures.DrawingInternal;
string output = TSDrawingColorHandler.GetSaveFormatFromColorIndex(-1); // should return "0xFFFFFFFF"
colorIndex: TS globally unique colorIndex.
Returns: Color saveFormat: hex "0xFF140413" or TS standard colorIndex "153".
This is the preferred format when saving to external files.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetStandardColors
Gets a list of standard colors that are allowed to be assigned to TS drawing objects (beams, etc).
Returns: A list of standard colors that are allowed to be assigned to TS drawing objects (beams, etc).

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetStandardColorNames
Returns a list standard color name albl-tags.
Returns: A list of standard color name albl-tags.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetStandardColorEnums
Gets a list of standard color enums that are allowed to be assigned to TS drawing objects (beams, etc).
Returns: A list of standard color enums that are allowed to be assigned to TS drawing objects (beams, etc).

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.TryGetSystemDrawingColor(System.Int32,System.Drawing.Color@)
Tries to convert an integer color value to a System.Drawing.Color.
If the colorIndex is positive, it attempts to find a color with a matching value in the Tekla.Structures.DrawingInternal.TSDrawingColorHandler.StandardColors dictionary.
colorIndex: The integer color value to convert.
color: When this method returns, contains the System.Drawing.Color equivalent of the input color value ;
Returns: Returns true if the integer color value was successfully converted to a System.Drawing.Color ; otherwise, false.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetColorIndexFromSystemDrawingColor(System.Drawing.Color)
Gets an integer color value from a System.Drawing.Color.
If the color has a matching value in the predefined Tekla.Structures.DrawingInternal.TSDrawingColorHandler.StandardColors dictionary,
the index of the matching color is returned instead of a newly generated integer.
color: The System.Drawing.Color.
Returns: Returns an integer color value representing the specified System.Drawing.Color.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.TryGetARGBFromColorIndex(System.Int32,Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Gets the ARGB struct corresponding to the colorIndex.
colorIndex: TS globally unique color index.
Argb: Color structure defining alpha, red, green, blue values.
Returns:
True if  can be initialized with either a standard color
or a decoded ARGB value from

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.GetColorIndexFromARGB(Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Gets the color index corresponding to the RGB struct.
ARGB: Color structure defining alpha, red, green, blue values.
Returns: The TS globally unique color index